In [1]:
# Note: this file created per Module 4.4.3: load and Read CSV Files.
# https://courses.bootcampspot.com/courses/1225/pages/4-dot-4-3-load-and-read-csv-files?module_item_id=497361

# Add the Pandas dependency.
import pandas as pd

In [2]:
#In the next cell, declare two variables: 
# one assigned to the schools_complete.csv file and one assigned to the students_complete.csv file. 
# (These files are located in the Resources folder.) 

# Files to load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

In [3]:
# ^^^ Cell above: When we want to get the indirect path to a file, 
# we use os.path.join() 
# to load a file from somewhere in our directory.

# If you decide to use this approach, you will need to import the os module with your Pandas dependency using the following code: 

# Add the dependencies.
# import pandas as pd
# import os

# Then, use the os.path.join() method to connect to the CSV files: 

# Files to load
# school_data_to_load = os.path.join("Resources", "schools_complete.csv")
# student_data_to_load = os.path.join("Resources", "students_complete.csv")

In [4]:
# Read the School Data File
# Now we'll read each CSV file with the Pandas function read_csv(). 
# Inside this function, we'll add the file we want to read, 
# which is one of many parameters that we can add to this function.

# Next step (below):

# The code below  to a new cell and run the cell 
# will allow us to read schools_complete.csv and store it in a DataFrame.

# Read the school data file and store it in a Pandas DataFrame.
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [5]:
# Read the Student Data File
# Now we'll read the student data file and store it in a Pandas DataFrame by adding the following code to a new cell:

# Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:
# Per Module 4.4.4: Commit Your Code: Save PySchools.ipynb to
# School_District_Analysis folder (make sure the Resources folder containing
# the CSV files is also in the School_District_Analysis folder).

# Instructions on how to commit code in Module 4.4.4 (refer to the module).
# https://courses.bootcampspot.com/courses/1225/pages/4-dot-4-4-commit-your-code?module_item_id=497366

In [7]:
# Module 4.5.1: Find Missing Values.
# The count() Method
# With the count() method, we can get a count of the rows for each column containing data. By default, "null" values are not counted, so you can often quickly identify which columns have missing data.

# Let's use the count() method on the school_data_df DataFrame. Add the following code to a new cell and run the cell:

# Determine if there are any missing values in the school data.
# (Cell below): school_data_df.count()

In [8]:
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [9]:
# ^^^ (Cell above: no missing values.)
# Do the same with student_complete.csv (below)

In [10]:
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [11]:
# ^^^ (Cell above: no missing values.)

In [12]:
# The isnull() Method (applied to the cell below):
# The Pandas library also has the isnull() method for determining empty rows. When you apply the isnull() method to a column, Series, or a DataFrame, a Boolean value will be returned, either "True" for the row or rows that are empty, i.e., null, or "False" for the rows that are not empty.

# Let's use the isnull() method on the school_data_df DataFrame.

# Determine if there are any missing values in the school data.
# school_data_df.isnull()
# When we execute this code, we see that every row that is not empty is given the Boolean value "False," which tells us that there are no missing values.

In [13]:
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [14]:
# Determine if there are any missing values in the student data.
student_data_df.isnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
39165,False,False,False,False,False,False,False
39166,False,False,False,False,False,False,False
39167,False,False,False,False,False,False,False
39168,False,False,False,False,False,False,False
39169,False,False,False,False,False,False,False

In [15]:
# To get the total number of empty rows, or rows that are "True," we can use the Pandas sum() method after the isnull() method, like this:

# Determine if there are any missing values in the student data.
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [16]:
# ^^^ (Cell above): This output allows us to more easily determine at a glance how many rows are empty in the student_data_df DataFrame (zero). This is more straightforward than output that shows "False" in thousands of rows.

In [17]:
#The notnull() Method
#Another method that we can use to find missing values is the notnull() method. When you apply the notnull() method to a column, Series, or a DataFrame, a Boolean will be returned: "True" for the row or rows that are not empty, or "False" for the row or rows that are empty. This method returns the opposite output of the isnull() method.

# Determine if there are not any missing values in the school data.
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [18]:
# ^^^ (Cell above): When we run this code, the output returns a copy of our school_data_df DataFrame, where all the rows that do not have any missing values are labeled "True." See the following image.

In [19]:
#Like we did with the student_data_df DataFrame, we can chain the notnull() method and the sum() method to get the sum of all the columns that are "True."

# Determine if there are not any missing values in the student data.
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [20]:
# ^^^ (Cell above): When we execute this code, we get the number of rows that are not null, which is 39,170 for each column.

In [21]:
# Module 4.5.3: Determine Data Types

# Data type: Boolean; Pandas name: bool; example: "True and False"
# Data type: Object; Pandas name: O, object; example: Typically strings; often used as a catchall for columns with different data types or other Python objects like tuples, lists, and dictionaries
# # Data type: datetime; Pandas name: datetime64; example: Specific moment in time with nanosecond precision, i.e., 2019-06-03 16:04:00.465107

# If integers store values from –32,768 to 32,767, they are 16 bits or int16.
# If integer store values from –2,147,483,648 to 2,147,483,647, they are 32 bits or int32.
# If integer store values from–9,223,372,036,854,775,808 to 9,223,372,036,854,775,807, they are 64 bits, or int64. 

# With the Pandas library, we can check the data types of each column by using the Pandas dtypes attribute on a DataFrame.

# To determine the data types in school_data.csv, type and run the following code (refer to cell below):

In [22]:
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [23]:
school_data_df["budget"].dtype

dtype('int64')

In [26]:
# Module 4.5.7 (Fix the Students' Names): CODE NOT WORKING

# Add each prefix and suffix to remove to a list.
# CODE WORKS: prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
# CODE DOES NOT WORK: for word in prefixes_suffixes:
# CODE DOES NOT WORK: student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")